
// 字库共用部分 2315
function dicBasic(){
	return [
	'國業爲發會經個產這來對進開們場時資實學報濟長現動關機區設體萬過農與說員務電種總從當內問還術將門應規題記點計強兩辦條達並廠際華調導組東廣決統黨領結營項議義車價間無書處質運縣軍幹隊團級標聯專費據權認幾沒職臺數單樣億優銷戰鄉頭給難觀創證織論別協變風見張轉劃準傳爭稅構積勢舉視參鎮該裝衆責備極確貿環話選亞麼帶採談嚴況僅氣識勞護興許戶馬則節較佈線羣醫歷佔續師負驗財類貨約藝連紀訊養獲賽聞堅熱銀遊檢爾錢評復斷範礎訪額雙讓須兒層獎黃遠維鐵樂邊滿響藥愛稱購屆餘請競穩繼緊劉聲隨擔號顯卻監適紅買陳圖陽試執盡講糧預親揮賣審榮衛屬險圍蘇龍羅噸匯減習飛寫礦輕擴終離澤蘭訓獻鋼損寧獨編換歐顧態鬥狀畫臨補寶綜雲納貧劇擊歲階豐館樹聽針勝貸網願託園輸討測讀築歡剛慶陸樓絕壓籤漢畝紹療貴紛灣錄訴順橋鄧揚溫庫訂練違幫幣災婦楊奮績雖筆夠奧鮮吳島覺貫擁細語簡腦債籌偉飯徹煙衝譽廳頓勵紙舊艱綠虧鬆韓輪攝雜貢罰傷亂脫踐葉謝孫郵誰償擇塊魚贊課懷駐輛齊潤畢敗趨紡靈殘儲鑑檔祕趙賓異鍾鍵輝躍莊儀鵬歸崗禮掛尋慮啓麗魯冊寬軌飲詩鄭漲純曉搶絲錦載傑烏戲遺跡遼趕覽錯薩奪誤詞潛蓋峯壞傾壯驚盤樑擺徑峽廈漸軟詢誠絡縮腳貼靜緩肅齡喬陣閉嗎鹽潔雞劑膽麥謀廢賀闊窮豬帳飾頒燈繞諸頂謂惡勁繳碼釦邁輯攤糾煉夢漁僑賠宮彈憑撥僞溝遷諾暢憂貝騰殺圓倫橫慣藍燒觸陝憲淨盧釋暫錫鳳鋪膠虛辭諮媽誼頻脹棄滅濱賞萊壇繪贏鋒籃紐轎販遞爐頗濤牆壽聖銅誕縱闢贈槍騙蟲鏡濃掃娛鑽礙遲鄰盜賺臉搖晉淚飽鎖診滾轄籲駛擾陰輩鍋賴欄毀倉巖嶺纖側鳴綱擠輿緣飼灘樸隱擬閒蔣鬧鄒牽滯嘗賈鞏蕩輔櫃顆兌欽憶敵闖閱貪馮厲駕驅穎襲賢鳥懲劍轟絨嘆賄嵐緒閣塗壩猶鑄閃誘辯綢恆賃譯呂碩喚鋁艦脅喪爛磚詳撫涼脈濫賦塵蹤凍湯豔薦頁攜譜遙灑顏嶽矚爺叢蓮敘鴻擡噴窩銜墾髒凱輻鉤鍛飄縫懸淺纜馳溼偵撲掙煥驟銳滬勸瑪頃鴨龐屢訟彌締鈴腫煩蘋廟僱釀丟瓊蕭犧撐拋紗茲騎銘頑妝窯蒼謹燦棟竊鬱攬韋膚罷聰腸廁戀綿粵闡軸壟襯慘釐嶄滲賭悅撈剝嬰緬譚籠詐幟棗澱獵夾帥滄倆釣臥驕餅贛儉樞彥繩勳鹼謙殼軋漿鈔貓獄蘊鏈憤紋鹹睞褲誇霧龔兇鶴蝕頸岡獅彎蠶潑繡聶韻渾臘醜諧祿澇擋鵝邏蝦廚鮑瀟頌瀾鷹閩賂墊滌攔禍閻壘鉛瑤閘懇齒槓獸澆竈狹瀕剎饒廂騷縛躋艙饋樁豈蘆黴荊僕囑壺諒貶疊遜湊淵蕪屍罵貯鈞軒贓筍鑼廬飢惱癱纏隸篩晝寵餓侖醬蔥摻摯楓傘謎齋悶駁嚇腎慄蔭羨堯鎊綸糞釘緯醞撓繭癡鏽曬濰攏啞厭譴蠟鑰聳蟻顛穢俠撾綁鑲駱鴿瘋聾綏禪潰閥傭棲睜薈熒墳錠暉錘懼覓鈣顫蘿癮繆雛韌貞緝簾豎懶鑿窪謠駝燙鋅瀝瞞隴繹誡錚鉀疇諱鱉恥詠縷爍氫鍍毆擱訣墜嶼軀磯箏鄲譁憐瘓釗暈膩訝餚瑩襪勻殲瀉櫻嬌斬矯駿絢竄皁洶澀揀曠攢嘔攪紉輟蠻誦嘯鴉賜馭綴皺鈕螞淪尷殯脣瑣驊龜絞濁欖鏟撿濾硯賊匱鱗鎂葦翹貽鰻幗漣竅諷鐸擲瀏燭侶搗煒錨稈綺囂竇樺饅駒瘡婁鈉灤吶鯔謊懾邇楨賬韜繽刪轍繚燁凜顱鋸塢渦禿熾飪賤蠅憊賑涇盞驢寢蟬絹閔鰲婭悽瀆瀘隕輾騁餃頤銨鱷鈺雋鐳綻誨誣朧斃綽繕詣櫥徠諄窺櫛琿挾緞癢斂紳癇閨巒縈苧癲鍥嫺渙篤禎籬謳紜鋤巔輒墮諜幀錳諳槳嗚擰馴鎳瘍驥鉗銓餡喲鵲漬鐫鷗氈鯨諦鍬藹鶯贍棧鎬摳諉絆餌謬潁輥濺滷斕鴕僥訥羈柵鏞鈦鈾蠍錐璽獷魷繃莖亙瓏鯉瘧鎢繅謗攙儼檻愷贖驀醃誹鏘鏗臍瑋軼賒纓濘姍獼鱘禱礪驛脛鄔餾饃銖詫澗鉻嘖囪鵑檸蹣鬢摟詼銬餒諺嶇噓錮譏獺薊馱慚鷺鸞詮躊滸鄖檳嗆膿擷崢鏢鈷驪嫋璉詭礬兗鈍頹銑駭謐謨欒鶩轆甌絳鋌襖殫櫚蛻癬廝燉藺騾佇虜屜縝儂闕鴛駟膾鵠嶗鴦簍烴鉑葷礫皚蓀塹愜贅閆曄箋鱔釁悵闌嘮閏蕎犛饗嶸擻頰嬸橢嘰繮犢罌甕憚鐮鐲鉚嫵銥骯鈈釺蝸潯謁辮轅賁蹺燾鉬滎鄺蒞饞蘢騫掄嗩灝牘釩鍶秈簫鉢賡燼鋰銻嗇螢儺軾靦訛齲綬籮覷閡驍縐糉鑾憫攆鑠鉉鍺闔贗靚鮁浹縉飈鍔蠣鯊鋇鯽詰詡颯鋥愴嘍曇狽癟奼鏵諫靂嚨薺懺痙詔唄碭餛蝨鸚鐺攣釒嚕嚀諶孿薔撻飩稟噠閭堊鎘餞髖鏤鵡嶴訶籟飆淶澠絀賅鋯瀅聵杴鎣鶉莧儷礱梟颶闞慫穌褻詒霽鵪陘詆壠謾僂埡蟄鐗謔嫗惲韞鑣餑鳩靄嬈慟緘餉頜譎褸顰燴櫟懌擯鐐蟎紱騮緗軲蠔瘻羥鱒軻酈躪騏鰭詛襤閬緲漚蹌飴嶧諭頷覬簣鰱鏜蜆誅釵緋訃钁覦莢鷲巋捫燜獰鰍頡鍇龕錕櫪懣訖虯驤惻鴣鉅鮎縹諍麩蠱廄皰撳訕鷓臏芻韃襠躉鯤綾鳶鎧鱸圇嘜鄆驁鸛鱖嶠櫱紓纈饈謫磣瞼銼灃誥覲媧鎰塋猙鶚鋃紕紂鈸嬋躥鯛槨鎵賚蘄鉍詁檜傯鯧璣痾擄鈐躚氳鍘釹儻薌壎曖鏑齟櫓齧躡鈑鈮灩齬鉞殞覘奐瀨饢餿峴氬撣鰥鮭顥鉸蝟騖椏鴆轂劊蟈戩癤愾犖觴謖紺儈櫺檣軔蘚鱈饌殮髏轤囁螄嚶鈀鈿逕邐廩噝紈潿漵煬齦諛錙樅貳閎訐綹淥頎穡羶絛謄靨瓚囀嬡鉺鳧癩縟縊櫬諤壙瀲鯢鮎磧誶韙囈俁慍篳傖筧饉藎崍癆鸝檁堖閹餘閶飭釧鶻鰉輦殤藪萵蟶躕齪輳紿琺縞訌讕擼鸕鈹駢煢銫齷硤魘釅軫鮫鑷顴輞鷂釔癰躑檉齶剮鬮貺轔顳闋鄴鱅謅嗶倀萇鶿簞綞鋨詬澮諢礆塏鄶欏厙鉭釷懨顓鯿鋮鐙鈄顎魴絝壢癘獁噥蕁摶蕕歟梔鏃噯鴇蹕驃儔讜駙摜耬螻鐃誚闃綣叄釤閂闐鬩鷸黿鏨儕餈驄紼釓堝絎黽鏌駑譙鰓蒔鮐簀鉦贄纘錛櫝賻櫸釕鎦縵歿慳繾鯖鎩鈰諡颼綰鷳鯗鐿銦鑌諂讖蓴攛閼碸嬀袞郟韉鈧錸慪諞嬙銣鉈幃闈嘵瓔銪閾輜齜蓽鑔讒蓯鐓鯡鉿鯇詎頦誑櫨氌鏍嬪僉篋鰣猻鋱綃貲眥璦垵颮髕硨銃鍀頇糲魎緡檾詘飠廡諼癭鵒櫞賾瀦騅緇諏軛嘸緱詿鯀梘剴誆鑭銠鰳蘺嚦躒褳襝鯪嶁鏝轡蠐戧巰愨鞝糹鰨綈糶潙頊澩鼴鷙錒媼齙儐鵓糴鈁綆鴰頏鍃齎鋏贐皸蕢縲癧瀧蔞濼蕒顢鎇冪熗橈糝饊釃錟鞀鵜憮瘂饜瘞譫軹諑籩齔讎銩黷懟鮒戇紇鯁劌摑鈥蟣鰹襉鷦憒縭鱺鱧奩臚鑥臠榪勱羆鮃鐠鏹瀋餳覡薟傴驏輊觶鍾櫧諮潷鶇籪緄葒黌餱鱟鶘鑊齏鱭蛺縑鶼緙嚳獪纊鷯鷚腡嬤禰羋鶓麼蔦釙鋟蕘詵塒弒鷥緦緹鼉鮪讞軺鋣紆飫蕷趲駔繒縶騶鵯鰾餷蠆鴟幬癉鰈崬腖僨襆韝覯鯝匭咼鸌繢譾撟巹鋦窶錈騍噲誄藶孌鋶櫳艫輅穭玀鎿蟯隉鍩鉕榿錆鞽唚輇顙諗攄闥駘銚籜餼獫紲鵂鏇訁厴鰩艤湞櫫縋鎄緶鈽驂黲鍤鐔蕆囅棖鑹鹺覿銱鴯鮞鐨鱝鰒軤鍰繯噦閽嚌戔鮚剄弳屨鐦閌鈳錁瞘閫鐒耮轢蘞懍壚鋝鶥鍆鰵聹錇鏷槧磽繰賕鴝蠑顬毿鰠騸灄鯴貰鎪賧鐋齠鰷膃閿誒攖瀠幘譖齇騭躓葤鯫躦',
	'国业为发会经个产这来对进开们场时资实学报济长现动关机区设体万过农与说员务电种总从当内问还术将门应规题记点计强两办条达并厂际华调导组东广决统党领结营项议义车价间无书处质运县军干队团级标联专费据权认几没职台数单样亿优销战乡头给难观创证织论别协变风见张转划准传争税构积势举视参镇该装众责备极确贸环话选亚么带采谈严况仅气识劳护兴许户马则节较布线群医历占续师负验财类货约艺连纪讯养获赛闻坚热银游检尔钱评复断范础访额双让须儿层奖黄远维铁乐边满响药爱称购届余请竞稳继紧刘声随担号显却监适红买陈图阳试执尽讲粮预亲挥卖审荣卫属险围苏龙罗吨汇减习飞写矿轻扩终离泽兰训献钢损宁独编换欧顾态斗状画临补宝综云纳贫剧击岁阶丰馆树听针胜贷网愿托园输讨测读筑欢刚庆陆楼绝压签汉亩绍疗贵纷湾录诉顺桥邓扬温库订练违帮币灾妇杨奋绩虽笔够奥鲜吴岛觉贯拥细语简脑债筹伟饭彻烟冲誉厅顿励纸旧艰绿亏松韩轮摄杂贡罚伤乱脱践叶谢孙邮谁偿择块鱼赞课怀驻辆齐润毕败趋纺灵残储鉴档秘赵宾异钟键辉跃庄仪鹏归岗礼挂寻虑启丽鲁册宽轨饮诗郑涨纯晓抢丝锦载杰乌戏遗迹辽赶览错萨夺误词潜盖峰坏倾壮惊盘梁摆径峡厦渐软询诚络缩脚贴静缓肃龄乔阵闭吗盐洁鸡剂胆麦谋废贺阔穷猪帐饰颁灯绕诸顶谓恶劲缴码扣迈辑摊纠炼梦渔侨赔宫弹凭拨伪沟迁诺畅忧贝腾杀圆伦横惯蓝烧触陕宪净卢释暂锡凤铺胶虚辞咨妈谊频胀弃灭滨赏莱坛绘赢锋篮纽轿贩递炉颇涛墙寿圣铜诞纵辟赠枪骗虫镜浓扫娱钻碍迟邻盗赚脸摇晋泪饱锁诊滚辖吁驶扰阴辈锅赖栏毁仓岩岭纤侧鸣纲挤舆缘饲滩朴隐拟闲蒋闹邹牵滞尝贾巩荡辅柜颗兑钦忆敌闯阅贪冯厉驾驱颖袭贤鸟惩剑轰绒叹贿岚绪阁涂坝犹铸闪诱辩绸恒赁译吕硕唤铝舰胁丧烂砖详抚凉脉滥赋尘踪冻汤艳荐页携谱遥洒颜岳瞩爷丛莲叙鸿抬喷窝衔垦脏凯辐钩锻飘缝悬浅缆驰湿侦扑挣焕骤锐沪劝玛顷鸭庞屡讼弥缔铃肿烦苹庙雇酿丢琼萧牺撑抛纱兹骑铭顽妆窑苍谨灿栋窃郁揽韦肤罢聪肠厕恋绵粤阐轴垄衬惨厘崭渗赌悦捞剥婴缅谭笼诈帜枣淀猎夹帅沧俩钓卧骄饼赣俭枢彦绳勋碱谦壳轧浆钞猫狱蕴链愤纹咸睐裤夸雾龚凶鹤蚀颈冈狮弯蚕泼绣聂韵浑腊丑谐禄涝挡鹅逻虾厨鲍潇颂澜鹰闽赂垫涤拦祸阎垒铅瑶闸恳齿杠兽浇灶狭濒刹饶厢骚缚跻舱馈桩岂芦霉荆仆嘱壶谅贬叠逊凑渊芜尸骂贮钧轩赃笋锣庐饥恼瘫缠隶筛昼宠饿仑酱葱掺挚枫伞谜斋闷驳吓肾栗荫羡尧镑纶粪钉纬酝挠茧痴锈晒潍拢哑厌谴蜡钥耸蚁颠秽侠挝绑镶骆鸽疯聋绥禅溃阀佣栖睁荟荧坟锭晖锤惧觅钙颤萝瘾缪雏韧贞缉帘竖懒凿洼谣驼烫锌沥瞒陇绎诫铮钾畴讳鳖耻咏缕烁氢镀殴搁诀坠屿躯矶筝郸哗怜痪钊晕腻讶肴莹袜匀歼泻樱娇斩矫骏绚窜皂汹涩拣旷攒呕搅纫辍蛮诵啸鸦赐驭缀皱钮蚂沦尴殡唇琐骅龟绞浊榄铲捡滤砚贼匮鳞镁苇翘贻鳗帼涟窍讽铎掷浏烛侣捣炜锚秆绮嚣窦桦馒驹疮娄钠滦呐鲻谎慑迩桢账韬缤删辙缭烨凛颅锯坞涡秃炽饪贱蝇惫赈泾盏驴寝蝉绢闵鳌娅凄渎泸陨辗骋饺颐铵鳄钰隽镭绽诲诬胧毙绰缮诣橱徕谆窥栉珲挟缎痒敛绅痫闺峦萦苎癫锲娴涣笃祯篱讴纭锄巅辄堕谍帧锰谙桨呜拧驯镍疡骥钳铨馅哟鹊渍镌鸥毡鲸谛锹蔼莺赡栈镐抠诿绊饵谬颍辊溅卤斓鸵侥讷羁栅镛钛铀蝎锥玺犷鱿绷茎亘珑鲤疟钨缫谤搀俨槛恺赎蓦腌诽锵铿脐玮轶赊缨泞姗猕鲟祷砺驿胫邬馏馍铢诧涧铬啧囱鹃柠蹒鬓搂诙铐馁谚岖嘘锢讥獭蓟驮惭鹭鸾诠踌浒郧槟呛脓撷峥镖钴骊袅琏诡矾兖钝颓铣骇谧谟栾鹜辘瓯绛铤袄殚榈蜕癣厮炖蔺骡伫虏屉缜侬阙鸳驷脍鹄崂鸯篓烃铂荤砾皑荪堑惬赘闫晔笺鳝衅怅阑唠闰荞牦飨嵘擞颊婶椭叽缰犊罂瓮惮镰镯铆妩铱肮钚钎蜗浔谒辫辕贲跷焘钼荥邝莅馋茏骞抡唢灏牍钒锶籼箫钵赓烬锂锑啬萤傩轼腼讹龋绶箩觑阂骁绉粽銮悯撵铄铉锗阖赝靓鲅浃缙飚锷蛎鲨钡鲫诘诩飒锃怆喽昙狈瘪姹铧谏雳咙荠忏痉诏呗砀馄虱鹦铛挛钅噜咛谌孪蔷挞饨禀哒闾垩镉饯髋镂鹉岙诃籁飙涞渑绌赅锆滢聩锨蓥鹑苋俪砻枭飓阚怂稣亵诒霁鹌陉诋垅谩偻垭蛰锏谑妪恽韫镳饽鸠霭娆恸缄饷颌谲褛颦烩栎怿摈镣螨绂骝缃轱蚝瘘羟鳟轲郦躏骐鳍诅褴阆缈沤跄饴峄谕颔觊篑鲢镗蚬诛钗绯讣镢觎荚鹫岿扪焖狞鳅颉锴龛锟枥懑讫虬骧恻鸪巨鲇缥诤麸蛊厩疱揿讪鹧膑刍鞑裆趸鲲绫鸢铠鲈囵唛郓骜鹳鳜峤蘖纾缬馐谪碜睑锉沣诰觐娲镒茔狰鹗锒纰纣钹婵蹿鲷椁镓赉蕲铋诂桧偬鲳玑疴掳钤跹氲铡钕傥芗埙暧镝龃橹啮蹑钣铌滟龉钺殒觇奂濑馕馊岘氩掸鳏鲑颢铰猬骛桠鸩毂刽蝈戬疖忾荦觞谡绀侩棂樯轫藓鳕馔殓髅轳嗫蛳嘤钯钿迳逦廪咝纨涠溆炀龈谀锱枞贰闳讦绺渌颀穑膻绦誊靥瓒啭嫒铒凫癞缛缢榇谔圹潋鲵鲇碛谇韪呓俣愠筚伧笕馑荩崃痨鹂檩垴阉余阊饬钏鹘鳇辇殇薮莴蛏蹰龊辏绐珐缟讧谰撸鸬铍骈茕铯龌硖魇酽轸鲛镊颧辋鹞钇痈踯柽腭剐阄贶辚颞阕邺鳙诌哔伥苌鹚箪缍锇诟浍诨硷垲郐椤厍钽钍恹颛鳊铖镫钭颚鲂绔坜疠犸哝荨抟莸欤栀镞嗳鸨跸骠俦谠驸掼耧蝼铙诮阒绻叁钐闩阗阋鹬鼋錾侪糍骢绋钆埚绗黾镆驽谯鳃莳鲐箦钲贽缵锛椟赙榉钌镏缦殁悭缱鲭铩铈谥飕绾鹇鲞镱铟镔谄谶莼撺阏砜妫衮郏鞯钪铼怄谝嫱铷铊帏闱哓璎铕阈辎龇荜镲谗苁镦鲱铪鲩讵颏诳栌氇镙嫔佥箧鲥狲铽绡赀眦瑷埯飑髌砗铳锝顸粝魉缗苘诎饣庑谖瘿鹆橼赜潴骓缁诹轭呒缑诖鲧枧剀诓镧铑鳓蓠呖跞裢裣鲮嵝镘辔蛴戗巯悫绱纟鳎绨粜沩顼泶鼹鸷锕媪龅傧鹁籴钫绠鸹颃锪赍铗赆皲蒉缧疬泷蒌泺荬颟镅幂炝桡糁馓酾锬鼗鹈怃痖餍瘗谵轵诼笾龀雠铥黩怼鲋戆纥鲠刿掴钬虮鲣裥鹪愦缡鲡鳢奁胪镥脔杩劢罴鲆镨镪沈饧觋莶伛骣轾觯钟槠咨滗鸫簖绲荭黉糇鲎鹕镬齑鲚蛱缣鹣缂喾狯纩鹩鹨脶嬷祢芈鹋么茑钋锓荛诜埘弑鸶缌缇鼍鲔谳轺铘纡饫蓣趱驵缯絷驺鹎鳔馇虿鸱帱瘅鲽岽胨偾幞鞲觏鲴匦呙鹱缋谫挢卺锔窭锩骒哙诔苈娈锍栊舻辂穞猡镎蛲陧锘钷桤锖鞒吣辁颡谂摅闼骀铫箨饩猃绁鸺镟讠厣鳐舣浈橥缒锿缏钸骖黪锸镡蒇冁枨镩鹾觌铞鸸鲕镄鲼鳆轷锾缳哕阍哜戋鲒刭弪屦锎闶钶锞眍阃铹耢轹蔹懔垆锊鹛钔鳘聍锫镤椠硗缲赇鸲蝾颥毵鳋骟滠鲺贳锼赕铴龆鲦腽阌诶撄潆帻谮齄骘踬荮鲰躜'
	]
}
//繁转简字库 467
function dicT2S()
{
	return [
	'伕併侷係倖倣偪偺傚傢僊儘儸冑凈剋剷劄勗勛勦卹叡唸啗啣喫噁噹嚐嚙嚥囌坵埜塚塤墻姦姪婬媮媿嬭孃寘崑崙弔彆彙彫彿徬徵惷慇慼慾懃懞扞捨捲揹搆搥搨搯摀摃撚撦擣攷旂昇晳暘曆曏朢朮枴柺榦槃檯櫂欞歎殀殭殽毘毬氾汎汙沍泝潟澂濛濬瀰灕炤煖燄燐燬燻燿牠獃玅玆珮琱瑯産甦疿痠痲痳瘉瘺癒癥盃盪睏睪瞇矇砲硃碕碪祐禦稜穀穫筴箇箠篛篠簑籐粧糰紮絃綑綫綵緻縯縳縴繈繙繫纍纔缾罈耑耡肐脩臕臙臟舖艣艷荳菴葯蒐蓆蔆蔔薑薙藷虖蜺衊衚裏製複襬覈覜觔觝訢註証詶誌説諠謼譆譔譟譭讌讚谿貍賸跼踡踫踰蹟蹠蹧輓迆迴迺週醆醱醼鉆鉋銲銹錶鍊鍼鎌鎗鎚鑒鑤鑪鑵閑閤闆闇阨阬阯陞隄隻霤鞦韆顔颱颳颺餔餬餵餽饑駮騣髣髮鬍鬚鬨魨鴈鵰鷰麵鼕齣嗊贇錡㑳㘚㥮掆㩳擓棡澾瞜穇紬䎱膞藭䙡䝼釾鏺䥇鐯鐥䦛䦟鮣鰌鰧䱷鳾鵁鴷鶄鶪鷈鷿龑於剗勩靉靆後啢囉嫿嶨嶢嶔廎掗撏曨檟渢溮滻濜溳漊澦獮瑲璡矓磑礄禕窵籙紘紝紖絰縕縗翬膕臢蘀蠨覎訩詗讅諝豶賙賵鍚鈃鉶鋩鑕鎡钂鎔鏰鐶鑞闓韍頲顒颸飀飥飿餄餎餏餜餶餺駸魛鮓鮍鮦鰂鱠鮺鱨鰮鰟鰜鰼鱣鶬鴞鴒鴴鵃鵮鶊鶡鶖鶺鷖鸇黶偽啟嘩媯嫻桿沖洩淒湧溈濕為眾簽緔缽著裊裡謚贋踴鍁鐘鐝鐧韁鯰鰛鷉鷴鸊鹵妳嚮靣寀眎処牀',
	'夫并局系幸仿逼咱效家仙尽㑩胄净克铲札勖勋剿恤睿念啖衔吃恶当尝啮咽苏丘野冢埙墙奸侄淫偷愧奶娘置昆仑吊别汇雕佛仿征蠢殷戚欲勤蒙捍舍卷背构捶拓掏捂扛拈扯捣考旗升晰旸历向望术拐拐干盘台棹棂叹夭僵淆毗球泛泛污冱溯舄澄蒙浚弥漓照暖焰磷毁熏耀它呆妙兹佩雕琅产苏痱酸淋淋愈瘘愈症杯荡困睾眯蒙炮朱埼砧佑御棱谷获䇲个棰箬筿蓑藤妆团扎弦捆线彩致演䌸纤繦翻系累才瓶坛端锄胳修膘胭脏铺艪艳豆庵药搜席菱卜姜剃薯呼霓蔑胡里制复摆核眺斤抵䜣注证酬志说喧呼嘻撰噪毁䜩赞溪狸剩局蜷碰逾迹跖糟挽迤回乃周盏酦燕钻铇焊锈表炼针镰枪锤鉴刨炉罐闲合板暗厄坑址升堤只溜秋千颜台刮飏晡糊喂馈饥驳鬃仿发胡须哄鲀雁雕燕面冬出唝赟锜㑇㘎㤘㧏㧐㧟㭎㳠䁖䅟䌷䎬䏝䓖䙌䞍䥺䥽䦂䦃䦅䦶䦷䲟䲡䲢䲣䴓䴔䴕䴖䴗䴘䴙䶮于刬勚叆叇后唡啰婳峃峣嵚庼挜挦昽槚沨浉浐浕涢溇滪狝玱琎眬硙硚祎窎箓纮纴纼绖缊缞翚腘臜萚蟏觃讻诇谉谞豮赒赗钖钘铏铓锧镃镋镕镚镮镴闿韨颋颙飔飗饦饳饸饹饻馃馉馎骎鱽鲊鲏鲖鲗鲙鲝鲿鳁鳑鳒鳛鳣鸧鸮鸰鸻鸼鹐鹒鹖鹙鹡鹥鹯黡偽啟嘩媯嫻桿沖洩淒湧溈濕為眾簽緔缽着裊裡謚贋踴鍁鐘鐝鐧韁鯰鰛鷉鷴鸊鹵你响面采视处床'
	];
}

//简转繁字库 145
function dicS2T()
{
	return [
	'㑳㘚㥮掆㩳擓棡澾瞜穇紬䎱膞藭䙡訢讌䝼釾鏺䥇鐯鐥䦛䦟鮣鰌鰧䱷鳾鵁鴷鶄鶪鷈鷿龑於剗勩靉靆後啢囉嫿嶨嶢嶔廎掗撏暘曨檟渢溮滻濜溳漊澦獮瑲璡矓磑礄禕窵籙紘紝紖絰縕縗翬膕臢蘀蠨覎訩詗讅諝豶賙賵贇鍚鈃鉶鋩錡鑕鎡钂鎔鏰鐶鑞闓韍頲顒颸飀飥飿餄餎餏餜餶餺駸魛鮓鮍鮦鰂鱠鮺鱨鰮鰟鰜鰼鱣鶬鴞鴒鴴鵃鵮鶊鶡鶖鶺鷖鸇黶徵',
	'㑇㘎㤘㧏㧐㧟㭎㳠䁖䅟䌷䎬䏝䓖䙌䜣䜩䞍䥺䥽䦂䦃䦅䦶䦷䲟䲡䲢䲣䴓䴔䴕䴖䴗䴘䴙䶮于刬勚叆叇后唡啰婳峃峣嵚庼挜挦旸昽槚沨浉浐浕涢溇滪狝玱琎眬硙硚祎窎箓纮纴纼绖缊缞翚腘臜萚蟏觃讻诇谉谞豮赒赗赟钖钘铏铓锜锧镃镋镕镚镮镴闿韨颋颙飔飗饦饳饸饹饻馃馉馎骎鱽鲊鲏鲖鲗鲙鲝鲿鳁鳑鳒鳛鳣鸧鸮鸰鸻鸼鹐鹒鹖鹙鹡鹥鹯黡征'
	]
}
// 转换
function convert(str, ss, tt){
	//ss = ss.split('')
	//tt = tt.split('')
	//for(var i = 0; i < ss.length; i++) {
	//	var tmp = ss[i];
	//	str = str.replace(new RegExp(ss[i], 'g'), tt[i])
	//}
	//return str;
	
	var re='';
	for(var i=0;i<str.length;i++){
		var nowStr = str.charAt(i);
		if(ss.indexOf(nowStr)!=-1)re+=tt.charAt(ss.indexOf(nowStr));
  		else re+=nowStr;
	}
	return re;
}
//转繁体
function Traditionalized(str){
	// 共用
	var val = dicBasic()
	var ss = val[1], tt = val[0]
	str = convert(str, ss, tt)
	// 补充
	val = dicS2T()
	ss = val[1]
	tt = val[0]
	return convert(str, ss, tt)
}
//转简体
function Simplized(str){
	// 共用
	var val = dicBasic()
	var ss = val[1], tt = val[0]
	str = convert(str, tt, ss)
	// 补充
	val = dicT2S()
	ss = val[1]
	tt = val[0]
	return convert(str, tt, ss)
}
// 补充部分
function Othered(cc){
	
	var ReWords = [
		// ***** 词组部分 *****
		// 么
		[/[\u2f33幺麽]/g, '么'],
		[/[麽么]([袅么蔑叔女呼弱台孺妹豚小娘贝魔娃令篇蛾麽姑絃帮姨花二店钱幺喝凤弦末妈微儿算匿挑])/g, '幺$1'],
		[/([多这什怎好那要是样特他])[\u2f33幺麽]/g, '$1么'],
		//[/[幺麽]([？！])/gm, '么$1'],
		[/甚([\u2f33幺麽])/g, '什么'],
		[/([三老六妆呼告弦幺小单装])[麽么]/g, '$1幺'],
		// 余
		//[/([其剩])馀/gm, '$1余'],
		//[/馀([留下韵])/gm, '余$1'],
		// 只
		[/[祗衹]([要想求剩留好会])/g, '只$1'],
		// 干
		[/乾([奶爷爸爹妈姨叔姐妹兄弟亲爽静脆等净])/g, '干$1'],
		[/([先强能])乾/g, '$1干'],
		// 沉
		[/([沈一面低阴深下暗很好不真睡])沈/g, '$1沉'],
		[/沈([沉入迷睡溺重没思闷浸声吟静稳甸淀沦压醉下香了])/g, '沉$1'],
		[/[沈沉]了[沈沉]/g, '沉了沉'],
		// 伙
		[/([小老同])夥/g, '$1伙'],
		[/夥([伴计])/g, '伙$1'],
		// 着
		[/([^显卓土撰昭较昭迩编])著/g, '$1着'],
		[/著([^名者书录称作体])/g, '着$1'],
		//[/湮([没])/g, '淹$1'],
		// 淡
		[/澹([^台])/g, '淡$1'],
		[/淡([澹])/g, '淡淡'],
		// 原
		[/塬([来本有野地处因定则以位始])/g, '原$1'],
		[/(塬塬|塬原|原塬)/g, '原原'],
		// 了
		[/瞭([解如])/g, '了$1'],
		[/([明])瞭/g, '$1了'],
		// 谷
		[/([辟山峡凹])榖/g, '$1谷'],
		[/榖([仓堆物类粒料])/g, '谷$1'],
		// 钟
		[/锺([爱情意])/g, '钟$1'],
		[/([上多点时分秒])锺/g, '$1钟'],
		// 案
		[/([方图文答杀此血重破惨查凶办档命报伏备立])桉/g, '$1案'],
		[/桉([子板台件情])/g, '案$1'],
		// 猛
		[/(勐)/g, '猛'],
		// 一
		[/壹([^贰佰仟万])/g, '一$1'],
		[/([唯统万])壹/g, '$1一'],
		//[/([你我他们爷娘兄弟姐妹])两/g, '$1俩'],
		//[/俩([个只群条件口对])/g, '两$1'],
		
		// ***** 错字部分 *****
		[/([计规企比])画/g, '$1划'],
		[/允([吸舔干])/g, '吮$1'],
		[/([吸舔])允/g, '$1吮'],
		[/阴端口/g, '阴阜'],
		// ***** 补充部分 *****
		[/\ud860\udd6c/g, '躏'],
		[/(\u9f8c\ud86d\udf2c|齷齰)/g, '龌龊'],
		[/(\u359e)/g, '喎'],
		[/摀/g, '捂'],
		[/\ud86c\udf72/g, '谀'],
		[/([蜡])蠋/g, '$1烛']
	];

	for(var i = 0; i < ReWords.length; i++)
		cc = cc.replace(ReWords[i][0], ReWords[i][1]);

	return cc;
}
