
// 字库共用部分 2664
function dicBasic() {
	return [
	'丟並亂亙齋亞嚲俥俔佇佔來侖儘侶俁俠倈備倀倆倉個們倫倲偉偑側偵僞傌傑傖傘儎傭傯傳傴債傷傾僂僅僉僑僕僥僨僱價儀儂億當儈儉儐儔儕擬盡償優儲儷羅攢儺儻儼兇兌兒兗內兩冊冪塗淨凍慄凜瀆處凱憑別刪剗㓨剄則剎剛剝剮剴創鏟劃劇劉劊劌劍劏劑劚勁動務勩勳勝勞勢積勱勵勸勻匭匯匱奩櫝區協卻龎厙廳廁歷厭廠厲厴參叄靉靆叢吳吶呂咼員唄唚嗊啢問啓啞銜嘓囉嘽喚巖喪喬單喲嗆嗇嗎嗚嗩嗶嘆嘍嘔嘖嘗嘜譁嘮嘯嘰嘵嘸惡噓噚噝噠噥噦噯噲噴噸嚀嚇嚌嚕齧嚦嚨嚳嚴嚶囂囀囁囅囈蘇囑囪國圇圍園圓圖團墶壋垵壩埡採執堅堊堖堝階堯報場鹼壪塊塋塏塒塢壎塵塹磚墊墜磽墮壇墳牆墾壓壘壙壚壞壟壠壢壯壼壺壽夠夢夾奐奧奪獎奮奼妝姍娛嫵婁婦婭嫿媧嬃嬀媰媼媽嫋嫗嫺嬈嬋嬌嬙嬡嬤嬪嬰嬸懶孋孌孫學孿宮實寧寢審寫寬寵寶將專尋對導鮮尷屓屆屍屜屢層屨屬阪岡嶨嶢峯峴島峽嶮崍崗崬崢嵐歲嶔嵾嶁嶄嶇嶗嶠嶧嶴嶸嶺嶼嶽巋巒巔巰巹紙帥師帶帳幀幃幫幓幗幘幟幣幬幹幾庫廎廂廄廈蔭廚廝廟廡廢廣廩廬癰弒弳張強彈彌彎錄彠彥彲徑從徠復徵徹恆恥悅悞悵悶悽惱惲惻愛愜愨訴愴愷愾態慍慘慚慟慣慪慫憖慮慳懾慶慺憂憊憐憒憚憤憫憮憲憶懇應懌檁懨懟懣懤懲懷懸懺懼歡戀戇鉞戔戧戩戲戰戱戶殞拋掗撏挩挾捫掃掄掆掙掛揀揚換揮揯搵構撳損搖搗搶摑摜摟摯摳摶摻撈撐撓撝撟撣撥撫撲撻撾撿擁擄擇擊擋擓擔攜據㩵擠擡舉擯擰擱擲擴擷擺擻擼擽擾攄攆攔攖攙攛攝攣攤攪攬敘敓敗斆敵數驅斂斃斕斬斷禍暘時曨晉晝暈暉陽暢暫暱曄曇曉曖曠疊曬書會朧術東杴梔柵樳梘條梟裏梲檮棶槤棄棖棗棟棡棧棲椏槼槶樿槮椲緘箋楊楓楨業極榲樧榪榮榿盤槍槓檟槧槨槳樁樂樅櫓樑樓標樞樢樣樫朴樹樺橈橋機橢橫檉檔檜檢檣臺檳檸檻櫃櫚櫛櫞櫟櫥櫧櫨櫪櫫櫬櫱櫳櫸櫺櫻欄權欏欒欖鬱欽歐歟歸歿殘殤殨殫殮殯殰殲殺殼毀毆醫絨毿犛氈氌氣氫氬氳決沒衝渢況洶溮滻濜浹涇蒞涗淚溳涼淥淪淵淶淺渙減渦測渾湊湞湯濚漊潙準溝溫溼滄滅滌滎澦滬滯滲滷滸滾滿漁漚漢漣漬漲漵漸漿潁潑潔潚潛瀉潤潯潰潷潿澀澆澇澗瀂澠澤澩澮澱澾濁濃濄濘濟濤濧濫濰濱闊濺濼濾瀅瀇瀏瀕瀘瀝瀟瀠瀦瀧瀨瀲瀾灃灑灘灝灡灣灤灩災爲烏烴無煉煒煙煢煥煩煬煱熅熒熗熱熲熾燁燈燉燒燙燜營燦燭燴燶薰燼燾爍爐爛爭爺爾牀閘牘癟牽犖犧犢狀獮狹狽猙猶猻獁獄獅獨獪獫獼獰獱獲獵獷獸獺獻玀茲璵瑒瑲璫現璡盞琺琿瑋瑣瑤瑩瑪璸璉璣璦璯環璽瓊瓏瓔鑲瓚甌甕罌產畝畢畫異疇瘲痙痾瘂瘮瘋瘍瘓瘞瘡瘧瘻療癆癇癉癘癡癢癤癧癩癬癭癮癱癲發皁皚皰皸皺藹礙骯襖罷頒辦絆綁鎊謗盜監盧蕩視眥矓衆睜飽鮑輩貝鋇繃筆閉闢邊編貶變辯辮鱉賓餅睞瞶瞘瞜瞞瞼矚鉢鉑駁補財蠶蒼艙詫蟬饞讒纏闡顫矯硜磑礄硤硨硯磠磣長腸鈔車陳襯稱誠騁遲馳齒蟲躊籌綢醜鋤雛碩碭碸確碼碽磧磯磾礆礎觸闖錘脣純綽辭詞賜聰蔥躥竄錯達貸礦礪礫礬礱禡禕祕祿禎鄲膽誕黨禱鄧遞締顛點電釣調諜禪禮禰禿秈穠稅稈稏釘頂錠訂鬥讀賭鍍鍛緞隊頓鈍鵝額訛餓餌稟種穇穌穎穭穡穢穩窵貳罰閥釩範販飯訪紡飛誹費紛糞豐鋒風馮縫諷鳳膚輻窩窪窮窯窶窺竅竇竈竊豎競輔賦負訃縛該鈣蓋趕贛鋼綱鎬鴿閣鉻給筍簹筧筴篔篠箏籙節龔鞏貢鉤購蠱顧關觀館貫規龜閨軌詭貴輥鍋過築篋篤篩籛篳簀簍簞簡簣簫籤簾駭韓號閡鶴賀轟鴻紅後籃饌籔籜籟籠籩籪籬籮籲麩粵護華話還緩黃謊輝賄諱誨繪葷貨糉糝饃糧糲糴糶糹糾紀紂約紆紇紈紉紋納紐紓紕紖紗紘級紜紝紬細紱紲紳紵飢跡譏雞績緝輯薊計記際繼莢頰賈鉀駕間艱繭薦鑑踐賤見鍵紹紺紼紿絀終組絅絎結絕絛絝絞絡絢絰統絲絹綃綆綈繡綌綏綐經艦餞蔣講醬膠驕鉸腳餃繳轎較誡緊錦謹進綜綞綠綣線綬維綯綰網綴綸綹綺綻綾綿緄緇緋緒緓鞝緗緙緡緣緦緬緯緱緲練緶緹荊莖鯨驚頸靜鏡舊駒鋸鵑覺訣鈞軍縕總緪縈縉縊縋縐縑縗縝縞縟縣縭縮縱縲纖縵縶縷縹繅繆繒織繕繚駿開顆課褲誇虧繞繢繩繮繯繰繸繹繽繾繿纇纈纊續纓纘纜罃饋蠟臘萊賴藍闌蘭讕覽鐳類釐離鯉麗罵羆羈羋羣羥羨義羶習翽翬隸聯蓮連鐮臉鏈輛諒遼鐐臨鄰鱗賃齡鈴靈領餾龍聾翹耬耮聖聞聲聳聵聶職聹聽攏隴蘆顱虜魯賂陸驢鋁輪論蘿邏鑼騾駱螞馬買麥賣邁脈饅蠻肅脅脛脫脹謾貓錨鉚貿麼黴鎂門錳謎覓閩鳴銘謬腎腖膕腡腦腫膃膞膩膾膿臍臏謀鈉難鬧餒釀鳥鑷鎳臚臢髒臠臥與興鋪艤鈕農諾鷗龐賠鵬艫豔芻苧騙飄頻貧蘋評頗譜齊騎豈訖蕎薘萴莊莧釺鉛遷謙錢鉗譴薔鍬親輕頃請趨軀萇蘀萬萵葉葒葤葦藥齲顴鵲讓饒韌認軟銳閏薩鰓賽蒕醟蓴蒔蓀蓯蓽虆騷閃陝贍賞賒設蔞蔦蕁蕆蕒蕕蕘蕢蕪蕭薀蕷詩蝨蝕識駛適釋飾試輸贖薈薌薟薳薴薵薺藎藝藪藭蘊藶雙誰順說飼鬆頌訟誦雖隨鎖藺蘄蘚蘞蘢蘺虛貪譚談討騰謄銻題體貼鐵虯蠁蛺蛻蜆銅頭頹託鴕馱駝襪頑蝟蝦蝸螿螄蟻螢韋違謂衛鎢誣霧誤錫螮螻蟄蟈蟎蠨蟣蟯蟶蠅蠆蠍蠐蠑蠔蠣襲銑轄鹹賢閒顯險餡鄉詳響項銷褘袞諧謝鋅釁鏽須許軒襏褌裝褳選詢馴訓訊遜鴉鴨訝閹鹽顏閻諺驗鴦養褸褻襆襉雜襴襝襠襤覎覘覡遙謠頁銥頤遺詣議誼譯陰銀飲隱覥覦覬覯覷覲覿觴觶訁訌訐訒訕誾鷹贏詠郵鈾遊誘於輿餘魚語譽訥諶訩訶診證詁詆詎詐詒詔詖詗詘詛讋詡詬詮詰詵詼詿預馭鴛轅遠願躍鑰閱雲鄖隕運醞韻載贊贓鑿責賊贈軋誄誅誑誒誚誥誶諂諄諉諍諏諑諗諛諝諞諡諢鍘輾賬趙轍鍺這貞針鎮陣諤諦諫諭諮諳諸諼謁謅謐謔謖謨謫譾謳䜀鄭質鍾軸驟豬貯鑄譎譖譙譫譸讅讌讖讜讞駐轉賺錐贅資蹤鄒鑽豶貙貟鞀靨贗賾貰貲貺貽賁賅賑賕賙賚賡賧齎贐賰賵賻贄贇黌鳧贔赬趲陘隉鄺鄔鄴躂蹌蹕蹣郟鄶鄆酈蹺躉躋躎躑躒躓躕躚躪躡躦軑軔軛軤軫軲軹軺軻軼軾輅輇輈輊輒輜輞輟輦輬輳轀轂鶯驀鎣轆轔轡轢轤逕邇邐吒酇醱醃釃釅釒釓釔釕釗釙釤釧釵釷釹釾鈀鈁鈃鈄鈈鈐鈑鈒鈥鈦鈧鈮鈰鈳鈷鈸鈹鈺鈽鈿飠餳飩餼飪飫飭飴餉餑餛餷餿饈饉饊饢鉈鉉鉍鉕鉦鉬鉭錇鉶鉺鉿銃銍銓銖銚銛銠銣銦懍閂閆闈閎閔閌闥閭閫鬮閬閾閶鬩閿閽閼闃闋闔闐闕闞銨銩銪銫銬銱銼鎇鋃鋌鋏鋙鐲鋝鋟鋣鋥鋦鋨鋩鋮鋯鋰鋱鋶錁錆錈灄錏錒錕錙錚錛錟錡錩錮錸鎿鍀鍃鍆鍇鍈鍔鍚鍠鍤鍥鍩騫鍰鍶鎄鎘鎛鎡鎦鎧鎩鎪鎰钂鎵鎶鐫鏃鏌鏍駔駟駙騶驛駑駘驍驊駢驪騏騍騅驂騭騖驁騮騸驃驄驏驥驤鏐鏑鏗鏘鏜鏝鏞鏢鏤鏨鏰鏵鏷鏹鏺鐃鐋鐒鐓鐔鐗鐙钁鐠鐥鐦鐨絳頊鐯鐶鐸鐺鐿鑊鑌鑔鑕鑞鑠鑣鑥鑭鑱鑹鑾鉋韙韞韜鎔閈闍闒闓闠闤隯雋餚靦齶霢霽靂靄靝靚颮颯颶颼飆飈齏鞽韃韉韍韝頇頎龕頏頜頡頦頮頲頴頷顎顒顓顙顢顥顬顰顳颭颸颻飀飣飥飿餄餈餎餏餕餖餜餱餶餺饁饗饜鳩鳶鴇鴆鴣鶇鸕鴝鴟鷥鴯鷙鴰鵂鸞鵓鸝鵠鵒鷳鵜鵡鶓鵪鵯鶉鶘鶚鶿鶥鶩鷂鶼鸚鷓鷚鷯鷦鷲鷸鸌鷺鸛馹駰駸騂騌騤騧驌驦驫鯁髏髕髖鬢鬹魎魘魛魢魨魴魷魺鮁鮃鮊鮋鯀鮍鮎鮐鮒鮓鮚鮜鯗鮞鮣鮦鮪鮫鮳鮶鮺鯇鰷鯊鯒鯔鯖鯛鹺鯝鯡鯢鯤鯧鯪鯫鯴鯷鯽鯿鰁鰂鰃鰆鰈鰉鰌鰍鰏鱷鰒鰮鰜鰟鰠鰣鰥鰧鰨鰩鰭鰱鰲鰳鰵鰹鰺鰻齔齟齙齠齜齦齬齪齷黽黿鼉鱸鱟鱭鱘鱺鱝鰼鰾鱂鱅鱈鱒鱔鱖鱠鱣鱤鱧鱨鱯䰾鯕䲁鶻黷黲鼴齇䲘鳲鳾鴒鴞鴴鴷鵁鵃鵐鵮鵷鵾鶄鶊鶖鶡鶪鶬鶲鶹鶺鷁鷈鷊鷖鷫鷽鷿鸂鸇鸏鸘䴉黶鼂齕齗龑鮭樸誆讎鏇',
	'丢并乱亘斋亚亸伡伣伫占来仑尽侣俣侠俫备伥俩仓个们伦㑈伟㐽侧侦伪㐷杰伧伞傤佣偬传伛债伤倾偻仅佥侨仆侥偾雇价仪侬亿当侩俭傧俦侪拟尽偿优储俪罗攒傩傥俨凶兑儿兖内两册幂涂净冻栗凛渎处凯凭别删刬刾刭则刹刚剥剐剀创铲划剧刘刽刿剑㓥剂㔉劲动务勚勋胜劳势积劢励劝匀匦汇匮奁椟区协却厐厍厅厕历厌厂厉厣参叁叆叇丛吴呐吕呙员呗吣唝唡问启哑衔啯啰啴唤岩丧乔单哟呛啬吗呜唢哔叹喽呕啧尝唛哗唠啸叽哓呒恶嘘㖊咝哒哝哕嗳哙喷吨咛吓哜噜啮呖咙喾严嘤嚣啭嗫冁呓苏嘱囱国囵围园圆图团垯垱埯坝垭采执坚垩垴埚阶尧报场碱塆块茔垲埘坞埙尘堑砖垫坠硗堕坛坟墙垦压垒圹垆坏垄垅坜壮壸壶寿够梦夹奂奥夺奖奋姹妆姗娱妩娄妇娅婳娲媭妫㛀媪妈袅妪娴娆婵娇嫱嫒嬷嫔婴婶懒㛤娈孙学孪宫实宁寝审写宽宠宝将专寻对导鲜尴屃届尸屉屡层屦属阪冈峃峣峰岘岛峡崄崃岗岽峥岚岁嵚㟥嵝崭岖崂峤峄岙嵘岭屿岳岿峦巅巯卺纸帅师带帐帧帏帮㡎帼帻帜币帱干几库庼厢厩厦荫厨厮庙庑废广廪庐痈弑弪张强弹弥弯录彟彦彨径从徕复征彻恒耻悦悮怅闷凄恼恽恻爱惬悫诉怆恺忾态愠惨惭恸惯怄怂慭虑悭慑庆㥪忧惫怜愦惮愤悯怃宪忆恳应怿檩恹怼懑㤽惩怀悬忏惧欢恋戆钺戋戗戬戏战戯户殒抛挜挦捝挟扪扫抡㧏挣挂拣扬换挥搄揾构揿损摇捣抢掴掼搂挚抠抟掺捞撑挠㧑挢掸拨抚扑挞挝捡拥掳择击挡㧟担携据擜挤抬举摈拧搁掷扩撷摆擞撸㧰扰摅撵拦撄搀撺摄挛摊搅揽叙敚败敩敌数驱敛毙斓斩断祸旸时昽晋昼晕晖阳畅暂暱晔昙晓暧旷叠晒书会胧术东锨栀栅桪枧条枭里棁梼梾梿弃枨枣栋㭎栈栖桠椝椢椫椮㭏缄笺杨枫桢业极榅榝杩荣桤盘枪杠槚椠椁桨桩乐枞橹梁楼标枢㭤样㭴朴树桦桡桥机椭横柽档桧检樯台槟柠槛柜榈栉橼栎橱槠栌枥橥榇蘖栊榉棂樱栏权椤栾榄郁钦欧欤归殁残殇㱮殚殓殡㱩歼杀壳毁殴医绒毵牦毡氇气氢氩氲决没冲沨况汹浉浐浕浃泾莅涚泪涢凉渌沦渊涞浅涣减涡测浑凑浈汤溁溇沩准沟温湿沧灭涤荥滪沪滞渗卤浒滚满渔沤汉涟渍涨溆渐浆颍泼洁㴋潜泻润浔溃滗涠涩浇涝涧澛渑泽泶浍淀㳠浊浓㳡泞济涛㳔滥潍滨阔溅泺滤滢㲿浏濒泸沥潇潆潴泷濑潋澜沣洒滩灏㳕湾滦滟灾为乌烃无炼炜烟茕焕烦炀㶽煴荧炝热颎炽烨灯炖烧烫焖营灿烛烩㶶薰烬焘烁炉烂争爷尔床闸牍瘪牵荦牺犊状狝狭狈狰犹狲犸狱狮独狯猃猕狞㺍获猎犷兽獭献猡兹玙玚玱珰现琎盏珐珲玮琐瑶莹玛瑸琏玑瑷㻅环玺琼珑璎镶瓒瓯瓮罂产亩毕画异畴疭痉疴痖瘆疯疡痪瘗疮疟瘘疗痨痫瘅疠痴痒疖疬癞癣瘿瘾瘫癫发皂皑疱皲皱蔼碍肮袄罢颁办绊绑镑谤盗监卢荡视眦眬众睁饱鲍辈贝钡绷笔闭辟边编贬变辩辫鳖宾饼睐瞆眍䁖瞒睑瞩钵铂驳补财蚕苍舱诧蝉馋谗缠阐颤矫硁硙硚硖砗砚硵碜长肠钞车陈衬称诚骋迟驰齿虫踌筹绸丑锄雏硕砀砜确码䂵碛矶䃅硷础触闯锤唇纯绰辞词赐聪葱蹿窜错达贷矿砺砾矾砻祃祎秘禄祯郸胆诞党祷邓递缔颠点电钓调谍禅礼祢秃籼秾税秆䅉钉顶锭订斗读赌镀锻缎队顿钝鹅额讹饿饵禀种䅟稣颖穞穑秽稳窎贰罚阀钒范贩饭访纺飞诽费纷粪丰锋风冯缝讽凤肤辐窝洼穷窑窭窥窍窦灶窃竖竞辅赋负讣缚该钙盖赶赣钢纲镐鸽阁铬给笋筜笕䇲筼筿筝箓节龚巩贡钩购蛊顾关观馆贯规龟闺轨诡贵辊锅过筑箧笃筛篯筚箦篓箪简篑箫签帘骇韩号阂鹤贺轰鸿红后篮馔䉤箨籁笼笾簖篱箩吁麸粤护华话还缓黄谎辉贿讳诲绘荤货粽糁馍粮粝籴粜纟纠纪纣约纡纥纨纫纹纳纽纾纰纼纱纮级纭纴䌷细绂绁绅纻饥迹讥鸡绩缉辑蓟计记际继荚颊贾钾驾间艰茧荐鉴践贱见键绍绀绋绐绌终组䌹绗结绝绦绔绞络绚绖统丝绢绡绠绨绣绤绥䌼经舰饯蒋讲酱胶骄铰脚饺缴轿较诫紧锦谨进综缍绿绻线绶维绹绾网缀纶绺绮绽绫绵绲缁绯绪绬绱缃缂缗缘缌缅纬缑缈练缏缇荆茎鲸惊颈静镜旧驹锯鹃觉诀钧军缊总緪萦缙缢缒绉缣缞缜缟缛县缡缩纵缧纤缦絷缕缥缫缪缯织缮缭骏开颗课裤夸亏绕缋绳缰缳缲䍁绎缤缱䍀颣缬纩续缨缵缆䓨馈蜡腊莱赖蓝阑兰谰览镭类厘离鲤丽骂罴羁芈群羟羡义膻习翙翚隶联莲连镰脸链辆谅辽镣临邻鳞赁龄铃灵领馏龙聋翘耧耢圣闻声耸聩聂职聍听拢陇芦颅虏鲁赂陆驴铝轮论萝逻锣骡骆蚂马买麦卖迈脉馒蛮肃胁胫脱胀谩猫锚铆贸么霉镁门锰谜觅闽鸣铭谬肾胨腘脶脑肿腽䏝腻脍脓脐膑谋钠难闹馁酿鸟镊镍胪臜脏脔卧与兴铺舣钮农诺鸥庞赔鹏舻艳刍苎骗飘频贫苹评颇谱齐骑岂讫荞荙荝庄苋钎铅迁谦钱钳谴蔷锹亲轻顷请趋躯苌萚万莴叶荭荮苇药龋颧鹊让饶韧认软锐闰萨鳃赛蒀蒏莼莳荪苁荜蔂骚闪陕赡赏赊设蒌茑荨蒇荬莸荛蒉芜萧蕰蓣诗虱蚀识驶适释饰试输赎荟芗莶䓕苧䓓荠荩艺薮䓖蕴苈双谁顺说饲松颂讼诵虽随锁蔺蕲藓蔹茏蓠虚贪谭谈讨腾誊锑题体贴铁虬蚃蛱蜕蚬铜头颓托鸵驮驼袜顽猬虾蜗螀蛳蚁萤韦违谓卫钨诬雾误锡䗖蝼蛰蝈螨蟏虮蛲蛏蝇虿蝎蛴蝾蚝蛎袭铣辖咸贤闲显险馅乡详响项销袆衮谐谢锌衅锈须许轩袯裈装裢选询驯训讯逊鸦鸭讶阉盐颜阎谚验鸯养褛亵幞裥杂襕裣裆褴觃觇觋遥谣页铱颐遗诣议谊译阴银饮隐觍觎觊觏觑觐觌觞觯讠讧讦讱讪訚鹰赢咏邮铀游诱于舆余鱼语誉讷谌讻诃诊证诂诋讵诈诒诏诐诇诎诅詟诩诟诠诘诜诙诖预驭鸳辕远愿跃钥阅云郧陨运酝韵载赞赃凿责贼赠轧诔诛诳诶诮诰谇谄谆诿诤诹诼谂谀谞谝谥诨铡辗账赵辙锗这贞针镇阵谔谛谏谕咨谙诸谖谒诌谧谑谡谟谪谫讴䜧郑质钟轴骤猪贮铸谲谮谯谵诪谉䜩谶谠谳驻转赚锥赘资踪邹钻豮䝙贠鼗靥赝赜贳赀贶贻贲赅赈赇赒赉赓赕赍赆䞐赗赙贽赟黉凫赑赪趱陉陧邝邬邺跶跄跸蹒郏郐郓郦跷趸跻䟢踯跞踬蹰跹躏蹑躜轪轫轭轷轸轱轵轺轲轶轼辂辁辀轾辄辎辋辍辇辌辏辒毂莺蓦蓥辘辚辔轹轳迳迩逦咤酂酦腌酾酽钅钆钇钌钊钋钐钏钗钍钕䥺钯钫钘钭钚钤钣钑钬钛钪铌铈钶钴钹铍钰钸钿饣饧饨饩饪饫饬饴饷饽馄馇馊馐馑馓馕铊铉铋钷钲钼钽锫铏铒铪铳铚铨铢铫铦铑铷铟懔闩闫闱闳闵闶闼闾阃阄阆阈阊阋阌阍阏阒阕阖阗阙阚铵铥铕铯铐铞锉镅锒铤铗铻镯锊锓铘锃锔锇铓铖锆锂铽锍锞锖锩滠铔锕锟锱铮锛锬锜锠锢铼镎锝锪钔锴锳锷钖锽锸锲锘骞锾锶锿镉镈镃镏铠铩锼镒镋镓鿔镌镞镆镙驵驷驸驺驿驽骀骁骅骈骊骐骒骓骖骘骛骜骝骟骠骢骣骥骧镠镝铿锵镗镘镛镖镂錾镚铧镤镪䥽铙铴铹镦镡锏镫镢镨䦅锎镄绛顼䦃镮铎铛镱镬镔镲锧镴铄镳镥镧镵镩銮铇韪韫韬镕闬阇阘闿阓阛陦隽肴腼腭霡霁雳霭靔靓飑飒飓飕飙飚齑鞒鞑鞯韨鞲顸颀龛颃颌颉颏颒颋颕颔颚颙颛颡颟颢颥颦颞飐飔飖飗饤饦饳饸糍饹饻馂饾馃糇馉馎馌飨餍鸠鸢鸨鸩鸪鸫鸬鸲鸱鸶鸸鸷鸹鸺鸾鹁鹂鹄鹆鹇鹈鹉鹋鹌鹎鹑鹕鹗鹚鹛鹜鹞鹣鹦鹧鹨鹩鹪鹫鹬鹱鹭鹳驲骃骎骍骔骙䯄骕骦骉鲠髅髌髋鬓鬶魉魇鱽鱾鲀鲂鱿鲄鲅鲆鲌鲉鲧鲏鲇鲐鲋鲊鲒鲘鲞鲕䲟鲖鲔鲛鲓鲪鲝鲩鲦鲨鲬鲻鲭鲷鹾鲴鲱鲵鲲鲳鲮鲰鲺鳀鲫鳊鳈鲗鳂䲠鲽鳇䲡鳅鲾鳄鳆鳁鳒鳑鳋鲥鳏䲢鳎鳐鳍鲢鳌鳓鳘鲣鲹鳗龀龃龅龆龇龈龉龊龌黾鼋鼍鲈鲎鲚鲟鲡鲼鳛鳔鳉鳙鳕鳟鳝鳜鲙鳣鳡鳢鲿鳠鲃鲯鳚鹘黩黪鼹齄鳤鸤䴓鸰鸮鸻䴕䴔鸼鹀鹐鹓鹍䴖鹒鹙鹖䴗鸧鹟鹠鹡鹢䴘鹝鹥鹔鸴䴙㶉鹯鹲鹴鹮黡鼌龁龂䶮鲑朴诓雠镟'
	]
}
//繁转简字库 967
function dicT2S() {
	return [
	'乗乹亁亝亯亱亷亾佀俛俬俻倐倸偘偪偸傚僊儁儌儗儵儹兎兠冄冐冺凃凓凟凣処凴刦刧刼剳剹劄劒効勅勌勠匃匄匟匲匳匵卽厀厛厠厤厰叅叚叡吚呌呪咊哶唕唫啎啑啗喆喒喦嗁嘅嘑嘠噉噑嚻囘囙囬囯圅坵坿垜垻埛埜埰埳堃堘堦塚塟塲塼墖墝墪墰壄壜壻夀夘奬妬妷姉姙娬娿婣婬媍媮媿嫰嬭嬾孼宂宼寀寔寕寘尅尟尠尲岅峝峩崐崑嵗嶃巵帀帋帬帯幇幑幙庻廏廐廕廵廹廻廼廽彔彞徃徧徴怱怳恠恡悤悳惏惥惪惷愬愽慂慙慤慴憇懃懕懽戞戹戼扞抝拏拕挐挱挵挼挿捄掽揑揫揷搇搉搤搥搨搯摃撡撦擕擧攩敂敍敎敭敺斮斲斵旣旤旹旾昚昬昰晳暎暠曏曡朞朢朶枏枒柟柹柺査栁栞栢栰桒桺棃棊椀椉椗椶椷椾楥楳槀槑槕槩樐樷橜橤檝櫂櫈欅欝欬欵歗歛殀殭殻殽毉毘毧氂氊氷汚沍泝涖涙淛淩湻滙滛潄澁澂澐澣濇濬濶灋灧炤烖烱煑煖煗熈燻燿爕爗牋牎牐牓牕犂犠狥猂猨獃獆獋獘獧玅珎琍琖琯琱琹瑇瑠璢瓈瓌甎甖産畆畊畧畮畱畵疉疎疘痐瘉瘖癄癅癒皐皜皷盃盇盌眎眞眡睠瞋瞖矁矙矴硶碕碪磟祑禩秊秔秖稬稭稺稾穅穉穤穽窓窰窻竢竪筞筦筩筯箒箠篛篹簒簮籑籢粃粇粦粬粰粺紥絜絶綉綫綳緐緑緔緜緥緼縂縧繐繖繙繦缾罇罋罎罏罸羗羢羴翄翫翶耡聼肎肐肧胷脃脇脗臈臋臕臙臝臯舘舩艕艢艪芲茘荍荳菉菑菓菕萲葠蒐蒓蒻蓆蓡蔕蔘蔴蔾蕋蕚蕱蕿薙藴藼蘂蘐蘤虖虵蚘蛕蜋蜖蜨蜺蝡蝯蝱蝳螎螘螡蟁蟇蠏蠒衂衇衕衖衚衞衺袟袠袵裌裠裦襃襇襍襢覇覔覜壹覩覰覻觕觝訦詧詶诓誖説読諐諙諠謌謏謡謩謭謼譅譔譭讁雠讐讛谿貛賔賫賮賸贋贜趂跥跴踁踰蹏蹚蹡蹧蹵躝躭躰躳躶輙輭輼菸菰辠辢辤辳迻逈薹捱逩遉遡遯遶邨摺郤鄕鄘酧醆醕醖醸醻醼徼鈅鈡鉄馀鉳銕鋂鋜鋭溷録錼鍁鍅鍫甯鍼鎋鎌鎚鎭鎲鎸鎻镟鏚鐝鐧鑀鑛鑵閙関閲闇榘闚阬陗陞陻陿隂隖隣隷雝雰霛靭靱鞉鞌鞵韈韤韮砦頟頼頽顇顋顔顦颿飃飇飏飜飤飱餁餬餹餻饍饝駄駈駡駮袷騒騗騣驘驩骽骾髈髣髥髩髴鬀鬉鬦鬬鬭鬰鮌鮝鯈醣鰐鰛鱓鱻鳬鴈鵞鵶鷀鷄鷉鷪鷰鸊鸎鹻麐麞麤麫麯鼃鼈龢伕併侷係倖倣偺傢儸冑凈剋剷勗勛勦卹唸啣喫噁噹嚐嚙嚥囌塤墻姦姪孃崙弔彆彙彫彿徬慇慼慾懞捨捲揹搆撚擣攷旂昇曆朮枴榦槃檯欞歎毬氾汎汙潟濛瀰灕燄燐燬牠玆珮瑯甦疿痠痲痳瘺癥盪睏睪瞇矇砲硃祐禦稜穀穫箇簑籐粧糰紮絃綑綵緻縯縳縴繫纍纔罈耑脩臟舖艷菴葯蔆蔔薑衊製複襬覈觔訢註証誌譟讚貍跼踡踫蹟蹠輓迆迴迺週鉆銲銹錶鍊鎗鑒鑤閑閤闆阨阯隄隻霤鞦韆颱颳颺餵餽饑髮鬍鬚鬨鵰麵鼕齣㑳㘚㥮㩳䎱䙡䝼䥇䦛䦟䱷偽啟嘩媯嫻桿沖洩淒湧溈濕為眾簽缽裊裡謚踴鐘韁鯰鷴鹵釦妳嚮靣瀋鉅麴麪佈',
	'乘乾乾斋享夜廉亡似俯私备倏睬侃逼偷效仙俊侥拟倏攒兔兜冉冒泯涂栗渎凡处凭劫劫劫札戮札剑效敕倦戮丐丐炕奁奁椟即膝厅厕历厂参假睿咿叫咒和咩唣吟忤喋啖哲咱岩啼慨呼嘎啖嗥嚣回因回国函丘附垛坝炯野采坎坤塍阶冢葬场砖塔硗墩坛野坛婿寿帽奖妒侄姊妊妩婀姻淫妇偷愧嫩奶懒孽冗寇采实宁置克鲜鲜尴坂峒峨昆昆岁崭卮匝纸裙带帮徽幕庶厩厩荫巡迫回乃回录彝往遍征匆恍怪吝匆德婪恿德蠢诉博恿惭悫慑憩勤恹欢戛厄帽捍拗拿拖拿挲弄挪插救碰捏揪插揿榷扼捶拓掏扛操扯携举挡叩叙教扬驱斫斫斫既祸时春慎昏是晰映皓向叠期望朵楠丫楠柿拐查柳刊柏筏桑柳梨棋碗乘碇棕缄笺楦梅稿梅桌概橹丛橛蕊楫棹凳榉郁咳款啸敛夭僵壳淆医毗绒牦毡冰污冱溯莅泪浙凌淳汇淫漱涩澄沄浣涩浚阔法滟照灾炯煮暖暖熙熏耀燮烨笺窗闸榜窗犁牺徇悍猿呆嗥嗥弊狷妙珍璃盏管雕琴玳琉琉璃瑰砖罂产亩耕略亩留画叠疏肛蛔愈喑憔瘤愈皋皓鼓杯盍碗视真视眷嗔翳瞅瞰碇碜埼砧碌帙祀年粳祇糯秸稚稿糠稚糯阱窗窑窗俟竖策管筒箸帚棰箬纂篡簪馔奁秕糠磷曲麸稗扎洁绝绣线绷繁绿绱绵褓缊总绦穗伞翻襁瓶樽瓮坛垆罚羌绒膻翅玩翱锄听肯胳胚胸脆胁吻腊臀膘胭裸皋馆船膀樯橹花荔荞豆绿灾果芲萱参搜莼箬席参蒂参麻藜蕊萼筲萱剃蕴萱蕊萱花呼蛇蛔蛔螂蛔蝶霓蠕猿虻玳融蚁蚊蚊蟆蟹茧衄脉同弄胡卫邪帙帙衽夹裙褒褒裥杂袒霸觅眺一睹觑觑粗抵谌察酬诳悖说读愆话喧歌谀谣谟谫呼䜧撰毁谪仇仇呓溪獾宾赍赆剩赝赃趁跺踩胫逾蹄趟跄糟蹴躏耽体躬裸辄软辒烟菇罪辣辞农移迥苔挨奔侦溯遁绕村折却乡墉酬盏醇酝酿酬燕侥钥钟铁余锫铁镅镯锐混录镎锨钫锹宁针辖镰锤镇镋镌锁旋戚镢锏锿矿罐闹关阅暗矩窥坑峭升堙狭阴坞邻隶雍氛灵韧韧鼗鞍鞋袜袜韭寨额赖颓悴腮颜憔帆飘飙扬翻饲飧饪糊糖糕膳馍驮驱骂驳夹骚骗鬃骡欢腿鲠膀仿髯鬓佛剃鬃斗斗斗郁鲧鲞鲦糖鳄鳁鳝鲜凫雁鹅鸦鹚鸡䴘莺燕䴙莺碱麟獐粗面曲蛙鳖和夫并局系幸仿咱家㑩胄净克铲勖勋剿恤念衔吃恶当尝啮咽苏埙墙奸侄娘仑吊别汇雕佛仿殷戚欲蒙舍卷背构拈捣考旗升历术拐干盘台棂叹球泛泛污舄蒙弥漓焰磷毁它兹佩琅苏痱酸淋淋瘘症荡困睾眯蒙炮朱佑御棱谷获个蓑藤妆团扎弦捆彩致演䌸纤系累才坛端修脏铺艳庵药菱卜姜蔑制复摆核斤䜣注证志噪赞狸局蜷碰迹跖挽迤回乃周钻焊锈表炼枪鉴刨闲合板厄址堤只溜秋千台刮飏喂馈饥发胡须哄雕面冬出㑇㘎㤘㧐䎬䙌䞍䦂䦶䦷䲣伪启哗妫娴杆冲泄凄涌沩湿为众签钵袅里谥踊钟缰鲶鹇卤扣你向靣沈巨曲面布'
	];
}

//简转繁字库 25
function dicS2T() {
	return [
	'㑳㘚㥮㩳䎱䙡訢䝼䥇䦛䦟䱷縕蘊誆讎誆轀醞餘鏇颺鏇讎讎',
	'㑇㘎㤘㧐䎬䙌䜣䞍䦂䦶䦷䲣緼藴诓雠诓輼醖馀镟飏镟雠雠'
	]
}

// 繁转简补充部分
// ⼳幺麽甚祗衹乾夥著澹塬瞭榖锺桉勐摀壹
// 处理一些特定的词组
function addT2S() {
	return [
	// ***** 词组部分 *****
	// 么
	[/[\u2f33幺麽]/g, '么'],
	[/[麽么]([袅么蔑叔女呼弱台孺妹豚小娘贝魔娃令篇蛾麽姑絃帮姨花二店钱幺喝凤弦末妈微儿算匿挑鸡])/g, '幺$1'],
	[/([多这什怎好那要是样特他])[\u2f33幺麽]/g, '$1么'],
	//[/[幺麽]([？！])/gm, '么$1'],
	[/甚([\u2f33幺麽])/g, '什么'],
	[/([三老六妆呼告弦幺小单装])[麽么]/g, '$1幺'],
	// 只
	[/[祗衹]([要想求剩留好会])/g, '只$1'],
	// 干
	[/乾([奶爷爸爹妈姨叔姐妹兄弟亲爽静脆等净])/g, '干$1'],
	[/([先强能])乾/g, '$1干'],
	// 沉
	[/([沈一面低阴深下暗很好不真睡])沈/g, '$1沉'],
	[/沈([沉入迷睡溺重没思闷浸声吟静稳甸淀沦压醉下香了])/g, '沉$1'],
	[/[沈沉]了[沈沉]/g, '沉了沉'],
	// 伙
	[/([小老同家])夥/g, '$1伙'],
	[/夥([伴计])/g, '伙$1'],
	[/([傢])[夥伙]/g, '家伙'],
	// 着
	[/([^显卓土撰昭较昭迩编])著([^名者书录称作体作])/g, '$1着$2'],
	//[/湮([没])/g, '淹$1'],
	// 淡
	[/澹([^台])/g, '淡$1'],
	[/淡([澹])/g, '淡淡'],
	// 原
	[/塬([来本有野地处因定则以位始])/g, '原$1'],
	[/(塬塬|塬原|原塬)/g, '原原'],
	// 了
	[/瞭([解如])/g, '了$1'],
	[/([明])瞭/g, '$1了'],
	// 谷
	[/([辟山峡凹])榖/g, '$1谷'],
	[/榖([仓堆物类粒料])/g, '谷$1'],
	// 钟
	[/锺([爱情意])/g, '钟$1'],
	[/([上多点时分秒])锺/g, '$1钟'],
	// 案桉
	[/([方图文答杀此血重破惨查凶办档命报伏备立归奇谜专并几食捕法])桉/g, '$1案'],
	[/桉([子板台件情例])/g, '案$1'],
	// 猛
	[/(勐)/g, '猛'],
	// 一
	[/([唯统万])壹([^贰佰仟万])/g, '$1一$2'],
	
	// ***** 错字部分 *****
	[/([计规企比])画/g, '$1划'],
	[/允([吸舔干])/g, '吮$1'],
	[/([吸舔])允/g, '$1吮'],
	[/阴端口/g, '阴阜'],
	// ***** 补充部分 *****
	[/\ud860\udd6c/g, '躏'],
	[/(\u9f8c\ud86d\udf2c|齷齰)/g, '龌龊'],
	[/(\u359e)/g, '喎'],
	[/摀/g, '捂'],
	[/\ud86c\udf72/g, '谀'],
	[/([蜡])蠋/g, '$1烛']
	]
}
